---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetProperty
source: html/b7ef5b57-40e8-0454-bddd-8ba9d85d4c53.htm
---
# AssetProperty Members

Adds a new connected asset attached to this asset property, if it allows it.